<template>

  <div class = "SekiGameplay">
    <h2>
      Описание правил игры в семейство игр Seki
    </h2>
    <p>
      Задана матрица A размера m x n, состоящая из неотрицательных чисел.
      Два игрока(обозначим их для удобства R и C), по очереди делают ходы.
      За каждый ход один из игроков может уменьшить любое положительное
      число матрицы на единицу.
      Игрок R стремится занулить строку, игрок C - столбец. Если после
      какого-то хода одна из строк и один из столбцов были занулены
      одновременно, то существуют два варианта развития событий.
    </p>
    <p>
      <ul>
        <li>
          Игра Seki: сделавший ход последним - выигрывает.
        </li>
        <li>
          Игра D-Seki: вышеуказанная ситуация является ничьей.
        </li>
      </ul>
    </p>
    <p>
      При всем вышенаписанном, мы учитываем, что входная матрица
      не имеет нулевых строк или столбцов(иначе игра закончена до её начала).

      Для каждой игры есть 4 различных вариации:
    <ul>
      <li>
        (0): Игроки не могут пропускать ходы
      </li>
      <li>
        (1R): R может пасовать, C - нет
      </li>
      <li>
        (1C): C может пасовать, R - нет
      </li>
      <li>
        (2): оба игрока имеют право пасовать.
      </li>
    </ul>
      Если в какой-то из циклов ходов оба игрока решили пропустить ход - 
      игра заканчивается ничьей.
  </p>
  </div>
</template>