<template>
  <div class = "SingleSuitGameplay">
    <h2>
      Описание правил игры в семейство игр Одномастка
    </h2>
    <ul>
      <li>
        <p>
          <h3>
            Одномастка-вист
          </h3>
            Всего есть 2k карт и 2 игрока A и B, каждый из которых получает k карт. 
            Соответственно, всего существует число сочетаний из 2k по k различных
            комбинаций определяющих игру. Изначально определено кто начинает, не
            умаляя общности будем считать, что A. Игрок берет одну из своих k карт
            и кладет на стол, B видит карту. После того, как B выбрал какую карту 
            положить, игрок, который положил большую карту выигрывает ход. Далее,
            победивший игрок ходит первым в следующем раунде. Через k раундов игрок,
            выигравший большее число ходов - выигрывает. Каждый игрок стремится 
            максимизировать количество набранных очков k1 и k2 соответственно. Легко
            заметить, что это игра с константной суммой, k1 + k2 = k.
        </p>
      </li>
      <li>
        <p>
          <h3>
            Взвешенная версия Одномастки-вист
          </h3>
            Задаются k чисел в интервале от -99 до 99, где каждое число обозначает
            количество очков, которые игроки получают, за победу на i-м ходу. Каждый
            игрок хочет максимизировать число своих очков.
            Таким образом в часте случаев мы вырождаемся либо в стандартную версию, либо в мизерную(все веса равны -1).
        </p>
      </li>
      <li>
        <p>
          <h3>
            Одномастка-дурак и D-дурак
          </h3>
            В этой игре 2 игрока каким-либо способом получают k кард, их количество может быть различно
            у обоих игроков. Далее так же известно, кто начинает заранее, не умаляя общности считаем, что
            начинает B. Он кладет в "открытую" любую свою карту на стол(пусть ее номинал i). Далее у A есть выбор:
            <ul>
              <li>
                Взять эту карту себе
              </li>
              <li>
                Сыграть карту j, такую, что j > i
              </li>
            </ul>
            Во втором случае, обе карты выбывают, и больше не используются в игре, а следующий ход начинает A. 
            Выигрывает игрок, у которого первым кончились карты. Его счет - число карт у оппонента. Если у обоих игроков
            кончились карты одновременно, в таком случае, если мы играем в обычную версию, то побеждает игрок, выигравший
            последний ход со счетом 1/2. В ином случае, при игре в D-дурак, оба игрока заканчивают со счетом 0.
        </p>
      </li>
      <li>
        <p>
          <h3>
            Взвешенные одномастка-дурак и D-дурак
          </h3>
            Задаются k чисел в интервале от -99 до 99, где каждое число обозначает вес i-й карточки и 
            в итоге счет избавившегося от карт игрока - это сумма весов карточек оппонента. Заметим, что если сумма отрицательная,
            то избавившийся от карт игрок - проигрывает. Так же, если сумма весов для избавившегося - 0, то в обычной
            версии он получает 1/2, в D-дураке - 0.
        </p>
      </li>
    </ul>
  </div>
</template>